controllers/SiteController.php

    public function actionIndex()
    {
        $searchModel = new StockSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $searchModelT = new TransactionsSearch();
        $dataProviderT = $searchModelT->search(Yii::$app->request->queryParams);

        $grandTotalSales = 0;
        $grandTotalSalesReturn  = 0;
        $monthlyTotalSales = 0;
        $monthlyTotalSalesReturn = 0;
        $weeklyTotalSales = 0;
        $weeklyTotalSalesReturn = 0;
        $quarterlyTotalSales  = 0;
        $quarterlyTotalSalesReturn = 0;
        $dailyTotalSales = 0;
        $dailyTotalSalesReturn = 0;
        $highestSales = 0;
        $highestSalesReturn = 0;


        $monthlySalesPercentage = 0;
        $weeklySalesPercentage  = 0;
        $quaterlySalesPercentage = 0;
        $dailySalesPercentage = 0;
        $highestSalePercentage = 0;

        $highestCustomer = SalesOrder::find()
                                    ->from('sales_order t1')
                                    ->select(['t2.name as name','sum(total) as total'])
                                    ->where('t1.user_id=:user_id or t1.user_id=:admin', [':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->innerJoin('customer t2', 't2.id = t1.customer_id')
                                    ->groupBy(['t2.name'])
                                    ->max('name');

        $highestSales = SalesOrder::find()
                                    ->select(['sum(total) as total'])
                                    ->where('user_id=:user_id or user_id=:admin', [':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->groupBy(['customer_id'])
                                    ->max('total');

        $highestSalesReturn = SalesOrderReturn::find()
                                    ->select(['sum(total) as total'])
                                    ->where('user_id=:user_id or user_id=:admin', [':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->groupBy(['customer_id'])
                                    ->max('total');

        $grandTotalSales = SalesOrder::find()
                                    ->where('user_id=:user_id or user_id=:admin', [':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->sum('total');

        $grandTotalSalesReturn = SalesOrderReturn::find()
                                    ->where('user_id=:user_id or user_id=:admin', [':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->sum('total');
---
SELECT MAX(name) FROM (SELECT "t2"."name" AS "name", sum(total) as total FROM "sales_order" "t1" INNER JOIN "customer" "t2" ON t2.id = t1.customer_id WHERE t1.user_id=1 or t1.user_id=1 GROUP BY "t2"."name") "c"
SELECT MAX(total) FROM (SELECT sum(total) as total FROM "sales_order" WHERE user_id=1 or user_id=1 GROUP BY "customer_id") "c"
SELECT MAX(total) FROM (SELECT sum(total) as total FROM "sales_order_return" WHERE user_id=1 or user_id=1 GROUP BY "customer_id") "c"
SELECT SUM(total) FROM "sales_order" WHERE user_id=1 or user_id=1
SELECT SUM(total) FROM "sales_order_return" WHERE user_id=1 or user_id=1


        $dailyTotalSalesReturn = $command->queryScalar();

        $totalCustomers = Customer::find()
                                    ->where('user_id=:user_id or user_id=:admin and active=:active', [':active' => 1,':user_id' => Yii::$app->user->getId(), ':admin' => 1])
                                    ->count();
---
SELECT COUNT(*) FROM "customer" WHERE user_id=1 or user_id=1 and active=1