views/distribution/_form.php

SELECT * FROM "user" WHERE ("status"=10) AND ("type"=2) ORDER BY "name"
---
        <div class="ibox-content">
            <div class="row">
                <div class="col-sm-4">
                    <?= $form->field($model, 'driver_id')->dropDownList(ArrayHelper::map(User::find()->where(['status' => 10, 'type' => 2 ])->orderBy('name ASC')->all(), 'id', 'name'),['prompt' => '', 'class' => 'form-control', 'onChange' => 'getDriver(this)']) ?>