views/sales-order/_search.php

        'method' => 'get',
    ]); ?>

    <?= $form->field($model, 'customer_id')->dropDownList(ArrayHelper::map(Customer::find()->where(['active' => 1 ])->orderBy('name ASC')->all(), 'id', 'name'),['prompt' => '', 'class' => 'form-control']) ?>
---
SELECT * FROM "customer" WHERE "active"=1 ORDER BY "name"