views/sales-order/index.php

                            ],
                            [
                                'attribute'=>'location_id',
                                'filter'=> ArrayHelper::map(Location::find()->where(['active' => 1])->orderBy('name ASC')->all(), 'id', 'name'),
---
SELECT * FROM "location" WHERE "active"=1 ORDER BY "name"

                            ],
                            [
                                'attribute'=>'customer_id',
                                'filter'=> ArrayHelper::map(Customer::find()->where(['active' => 1])->orderBy('name ASC')->all(), 'id', 'name'),
---
SELECT * FROM "customer" WHERE "active"=1 ORDER BY "name"