views/po/_form.php

            <div class="ibox-content">
                <div class="row">
                    <div class="col-sm-3">
                        <?= $form->field($modelPo, 'vendor_id')->dropDownList(ArrayHelper::map(Vendor::find()->where(['active' => 1 ])->orderBy('name ASC')->all(), 'id', 'name'),['prompt' => '', 'class' => 'form-control', 'onChange' => 'getVendor(this)']) ?>
---
SELECT * FROM "vendor" WHERE "active"=1 ORDER BY "name"

                                    <td>
                                        <?php
                                            echo $form->field($modelPoLine, "[{$i}]product_id")->begin();
                                            echo Html::activeDropDownList($modelPoLine, "[{$i}]product_id", ArrayHelper::map(Product::find()->where(['active' => 1, 'product_category_id' => 1 ])->orderBy('item_name ASC')->all(), 'id', 'item_name'), ['prompt' => "",'maxlength' => true, 'class' => 'form-control', 'onChange' => 'getProduct(this)']); //Field
---
SELECT * FROM "product" WHERE ("active"=1) AND ("product_category_id"=1) ORDER BY "item_name"