views/po/_search.php

SELECT * FROM "vendor" WHERE "active"=1 ORDER BY "name"
---

    <?= $form->field($modelPo, 'number') ?>

    <?= $form->field($modelPo, 'vendor_id')->dropDownList(ArrayHelper::map(Vendor::find()->where(['active' => 1 ])->orderBy('name ASC')->all(), 'id', 'name'),['prompt' => '', 'class' => 'form-control']) ?>