views/po/index.php

                            ],
                            [
                                'attribute'=>'location_id',
                                'filter'=> ArrayHelper::map(Location::find()->where(['active' => 1])->orderBy('name ASC')->all(), 'id', 'name'),
---
SELECT * FROM "location" WHERE "active"=1 ORDER BY "name"

                            ],
                            [
                                'attribute'=>'vendor_id',
                                'filter'=> ArrayHelper::map(Vendor::find()->where(['active' => 1])->orderBy('name ASC')->all(), 'id', 'name'),
---
SELECT * FROM "vendor" WHERE "active"=1 ORDER BY "name"